Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: With Quarkus you can deploy your favorite Java HTTP frameworks as Amazon Lambda's using either the https://docs.aws.amazon.com/apigateway/latest/developerguide/http-api.html[AWS Gateway HTTP API] or https://docs.aws.amazon.com/apigateway/latest/developerguide/apigateway-rest-api.html[AWS Gateway REST API]. This means that you can deploy your microservices written with RESTEasy (JAX-RS), Undertow (servlet), Reactive Routes, xref:funqy-http.adoc[Funqy HTTP] or any other Quarkus HTTP framework as an AWS Lambda.
ja_jp: Quarkusでは、 link:https://docs.aws.amazon.com/apigateway/latest/developerguide/http-api.html[AWS Gateway HTTP API] または link:https://docs.aws.amazon.com/apigateway/latest/developerguide/apigateway-rest-api.html[AWS Gateway REST API] を使用して、お気に入りのJava HTTPフレームワークをAmazon Lambdaとしてデプロイできます。 つまり、RESTEasy（JAX-RS）、Undertow（サーブレット）、Reactive Routes、 xref:funqy-http.adoc[Funqy HTTP] 、その他のQuarkus HTTPフレームワークで記述されたマイクロサービスをAWS Lambdaとしてデプロイできます。

source: With Quarkus you can deploy your favorite Java HTTP frameworks as Amazon Lambda's using either the https://docs.aws.amazon.com/apigateway/latest/developerguide/http-api.html[AWS Gateway HTTP API] or https://docs.aws.amazon.com/apigateway/latest/developerguide/apigateway-rest-api.html[AWS Gateway REST API]. This means that you can deploy your microservices written with RESTEasy Reactive (JAX-RS), Undertow (servlet), Reactive Routes, xref:funqy-http.adoc[Funqy HTTP] or any other Quarkus HTTP framework as an AWS Lambda.
ja_jp: Quarkusでは、link:https://docs.aws.amazon.com/apigateway/latest/developerguide/http-api.html[AWS Gateway HTTP API] または link:https://docs.aws.amazon.com/apigateway/latest/developerguide/apigateway-rest-api.html[AWS Gateway REST] API のいずれかを使用して、お気に入りの Java HTTP フレームワークを Amazon Lambdaとしてデプロイできます。つまり、RESTEasy (JAX-RS)、Undertow (サーブレット)、Reactive Route、xref:funqy-http.adoc[Funqy HTTP]、その他の Quarkus の HTTP フレームワークで書かれたマイクロサービスを、AWS Lambda としてデプロイすることができます。

source: With Quarkus you can deploy your favorite Java HTTP frameworks as Amazon Lambda's using either the https://docs.aws.amazon.com/apigateway/latest/developerguide/http-api.html[AWS Gateway HTTP API] or https://docs.aws.amazon.com/apigateway/latest/developerguide/apigateway-rest-api.html[AWS Gateway REST API]. This means that you can deploy your microservices written with RESTEasy Reactive (our Jakarta REST implementation), Undertow (servlet), Reactive Routes, xref:funqy-http.adoc[Funqy HTTP] or any other Quarkus HTTP framework as an AWS Lambda.
ja_jp: Quarkusでは、 link:https://docs.aws.amazon.com/apigateway/latest/developerguide/http-api.html[AWS Gateway HTTP API] または link:https://docs.aws.amazon.com/apigateway/latest/developerguide/apigateway-rest-api.html[AWS Gateway REST API] のいずれかを使用して、お気に入りのJava HTTPフレームワークをAmazon Lambdaとしてデプロイすることができます。つまり、RESTEasy Reactive（Jakarta RESTの実装）、Undertow（サーブレット）、Reactive Routes、Funq xref:funqy-http.adoc[y HTTP] 、その他のQuarkus HTTPフレームワークで書かれたマイクロサービスをAWS Lambdaとしてデプロイできるのです。

source: With Quarkus, implementing a service requires to implement the generated service interface based on Mutiny, a Reactive Programming API integrated in Quarkus, and expose it as a CDI bean. Learn more about Mutiny on the xref:mutiny-primer.adoc[Mutiny guide]. The service class must be annotated with the `@io.quarkus.grpc.GrpcService` annotation.
ja_jp: Quarkusは、Quarkusに統合されたReactive Programming APIであるMutinyを使用した追加モデルも提供しています。Mutinyの詳細については、 xref:mutiny-primer.adoc[Mutiny ガイド] を参照してください。サービスクラスは `@io.quarkus.grpc.GrpcService` アノテーションが付与されている必要があります。

source: With Quarkus, our main goal is to make developer lives easier and bring back developer joy. In 1.13, we added a new element to the (not so secret) Quarkus recipe: DevServices.
ja_jp: Quarkusでは、開発者の生活を楽にし、開発者の満足感を取り戻すことを主な目標としています。1.13では、Quarkusのレシピに新しい要素を追加しました（秘密ではありません）。それがDevServicesです。

source: With Quarkus, there is no need to create an `Application` class. It's supported, but not required. In addition, only one instance of the resource is created and not one per request. You can configure this using the different `*Scoped` annotations (`ApplicationScoped`, `RequestScoped`, etc).
ja_jp: Quarkus では、 `Application` クラスを作成する必要がありません。作成は可能ですが、必須ではありません。加えて、リソースは 1 つのみが作成され、リクエスト毎に 1 つではありません。これは、異なる `*Scoped` アノテーション (`ApplicationScoped`、 `RequestScoped` など) を使用することで設定可能です。

source: With Quarkus, there's no need to use a specific Maven plugin to process the Avro schema, this is all done for you by the `quarkus-avro` extension!
ja_jp: Quarkus を使用すると、Avro スキーマを処理するために特定の Maven プラグインを使用する必要はありません。これはすべて、 `quarkus-avro` エクステンションによって行われます。

source: With Quarkus, you can deploy your favorite Java HTTP frameworks as AWS Lambda's using either the https://docs.aws.amazon.com/apigateway/latest/developerguide/http-api.html[AWS Gateway HTTP API] or https://docs.aws.amazon.com/apigateway/latest/developerguide/apigateway-rest-api.html[AWS Gateway REST API]. This means that you can deploy your microservices written with Quarkus REST (our Jakarta REST implementation), Undertow (servlet), Reactive Routes, xref:funqy-http.adoc[Funqy HTTP] or any other Quarkus HTTP framework as an AWS Lambda.
ja_jp: Quarkus を使用すると、 https://docs.aws.amazon.com/apigateway/latest/developerguide/http-api.html[AWS Gateway HTTP API] または https://docs.aws.amazon.com/apigateway/latest/developerguide/apigateway-rest-api.html[AWS Gateway REST API] のいずれかを使用して、お気に入りの Java HTTP フレームワークを AWS Lambda としてデプロイできます。これは、Quarkus REST (Jakarta REST 実装)、Undertow (サーブレット)、Reactive Routes、 xref:funqy-http.adoc[Funqy HTTP] 、またはその他の Quarkus HTTP フレームワークで記述されたマイクロサービスを AWS Lambda としてデプロイできることを意味します。

source: With Quarkus, you can easily configure OIDC providers such as link:https://www.keycloak.org/documentation[Keycloak], link:https://developer.okta.com/[Okta], link:https://auth0.com/docs/[Auth0], and other xref:security-openid-connect-providers.adoc[well-known social OIDC and OAuth2 providers].
ja_jp: Quarkusを使用すると、link:https://www.keycloak.org/documentation[Keycloak]、link:https://developer.okta.com/[Okta]、link:https://auth0.com/docs/[Auth0]、およびその他の xref:security-openid-connect-providers.adoc[有名なソーシャル OIDC や OAuth2 プロバイダー] などの OIDC プロバイダーを簡単に設定できます。

source: With Quarkus, you can easily configure a datasource, or several if need be.
ja_jp: Quarkusを使用すると、データソースを簡単に設定することができます。

source: With RESTEasy Reactive you don’t even need to use `@PathParam` or `@RestPath` if your parameter has the same name as a path parameter, and similarly you can skip `@Context` for all the known context types, which makes it even simpler:
ja_jp: RESTEasy Reactive では、パラメーターがパスパラメーターと同じ名前であれば `@PathParam` や `@RestPath` を使用する必要はありませんし、同様に、既知のすべてのコンテキストタイプに対して `@Context` を省略することができます。

source: With SDKMAN!, you can also install popular Java tools, including the Quarkus CLI.
ja_jp: SDKMAN! を使用すると、Quarkus CLI などの一般的な Java ツールをインストールすることもできます。

source: With SNI enabled, the client indicates the server name during the TLS handshake, which allows the server to select the appropriate certificate:
ja_jp: SNI が有効な場合、クライアントは TLS ハンドシェイク中にサーバー名を示します。これにより、サーバーが適切な証明書を選択できるようになります。

source: With Section
ja_jp: セクションあり

source: With Stork and the Stork Kubernetes Service Discovery on the classpath, we need to tell Stork how to locate and select the service. To achieve this, we just add `stork.[service-name].[kebab-cased-property-name]` into the Quarkus application configuration. In our case, to configure the rest-service and indicate to Stork that it should use Kubernetes, we add:
ja_jp: クラスパスにStorkとStork Kubernetes Service Discoveryがある状態で、Storkにサービスの位置と選択方法を伝える必要があります。これを実現するには、Quarkusのアプリケーション設定に `stork.[service-name].[kebab-cased-property-name]` を追加するだけです。今回のケースでは、rest-service を設定し、StorkにKubernetesを使うべきだと示すために、次のように追加します。

source: With TLS:
ja_jp: TLSを利用する場合

source: With `AveragePriceEntity` being a Jakarta Persistence entity extending `CheckpointEntity`:
ja_jp: `AveragePriceEntity` は `CheckpointEntity` を拡張する Jakarta Persistence エンティティーであるため、以下のようになります。

source: With `GET`, `POST` and `DELETE` methods implemented, we can now create a minimal web page to try the RESTful application out. We will use https://jquery.com/[jQuery] to simplify interactions with the backend:
ja_jp: `GET`、 `POST`、および `DELETE` メソッドが実装されたので、RESTful アプリケーションを試すための最小限の Web ページを作成できます。 https://jquery.com/[jQuery] を使用して、バックエンドとのやり取りを簡素化します。

source: With `GET`, `POST` and `DELETE` methods implemented, we may now create a minimal web page to try the RESTful application out. We will use https://jquery.com/[jQuery] to simplify interactions with the backend:
ja_jp: `GET`、 `POST`、および `DELETE` メソッドが実装されたので、RESTful アプリケーションを試すための最小限の Web ページを作成できます。 https://jquery.com/[jQuery] を使用して、バックエンドとのやり取りを簡素化します。

source: With `STARTTLS`:
ja_jp: `STARTTLS` の場合:

source: With `quarkus.flyway.migrate-at-start=true`, as in the example above, Quarkus will execute the Flyway migration as part of the xref:lifecycle.adoc[application startup].
ja_jp: 上記の例のように `quarkus.flyway.migrate-at-start=true` とすることで Quarkusは xref:lifecycle.adoc[アプリケーションの起動] の一部としてFlywayのマイグレーションを実行します。

source: With `quarkus.http.header`, you can easily add headers to your HTTP responses:
ja_jp: `quarkus.http.header` で、HTTPレスポンスに簡単にヘッダーを追加することができます。

source: With a Custom `ConfigSource` it is possible to read additional configuration values and add them to the `Config` instance in a defined ordinal. This allows overriding values from other sources or falling back to other values.
ja_jp: カスタム `ConfigSource` では、追加の設定値を読み込んで、定義された順序で `Config` インスタンスに追加することができます。これにより、他のソースからの値をオーバーライドしたり、他の値にフォールバックしたりすることができます。

source: With a Maven project generated by our tooling, integration tests are disabled by default and only run for native builds. Enable them with `-DskipITs=false`.
ja_jp: ツールで生成された Maven プロジェクトでは、統合テストはデフォルトで無効になっており、ネイティブビルドの時のみ実行されます。 `-DskipITs=false` を指定して有効にしてください。

source: With a _named_ TLS configuration established, you can then configure the client to use it:
ja_jp: _名前付き_ TLS 設定が確立されたら、クライアントがそれを使用するように設定できます。

source: With a container runtime running, invoke Maven's `verify` goal with `-DskipITs=false -Dquarkus.test.integration-test-profile=test-with-native-agent` to run the JVM mode integration tests and generate the native image configuration. For example:
ja_jp: コンテナーランタイムを実行すると、 Maven の `verify`ゴールを `-DskipITs=false -Dquarkus.test.integration-test- プロファイル=test-with-native-agent`で呼び出して、JVM モードの結合テストを実行し、 ネイティブイメージ設定を生成します。 たとえば:

source: With config mappings it is possible to group multiple configuration properties in a single interface that share the same prefix.
ja_jp: 設定マッピングでは、同じプレフィックスを持つ複数の設定プロパティを1つのインターフェースにまとめることができます。

source: With container reuse enabled, old containers (especially with obsolete configuration) might be left running indefinitely, even after starting a new Quarkus dev mode session or test suite execution.
ja_jp: コンテナの再利用を有効にすると、新しいQuarkus開発モードセッションやテストスイートの実行を開始した後でも、古いコンテナ（特に実行可能ファイルが古い）が無期限に実行されたままになる可能性があります。

source: With generated finder and query methods, as we've previously shown, everything is validated at build-time, but if you want to write non-type-safe queries, you can always use the provided methods of `PanacheRepository`:
ja_jp: これまでに示したように、生成されたファインダーメソッドとクエリメソッドを使用すると、すべてがビルド時 に検証されますが、タイプセーフでないクエリを作成したい場合は、`PanacheRepository` が提供するメソッドをいつでも使用できます。

source: With https://code.quarkus.io/?a=quinoa-bowl&j=17&e=io.quarkiverse.quinoa%3Aquarkus-quinoa[code.quarkus.io]
ja_jp: link:https://code.quarkus.io/?a=quinoa-bowl&j=17&e=io.quarkiverse.quinoa%3Aquarkus-quinoa[code.quarkus.io] を使用した場合

source: With https://github.com/quarkusio/quarkus/pull/29108[PR #29108] merged into the Quarkus main branch, Quarkus applications can use the SnapStart features on AWS Lambda. The feature will land in the 2.15 platform release as an experimental feature.
ja_jp: https://github.com/quarkusio/quarkus/pull/29108[PR #29108] が Quarkus メイン ブランチにマージされると、Quarkus アプリケーションは AWS Lambda で SnapStart 機能を使用できます。 この機能は、実験的な機能として 2.15 プラットフォーム リリースに組み込まれます。

source: With in-memory channels we were able to test application code processing messages without starting a Kafka broker. Note that different in-memory channels are independent, and switching channel connector to in-memory does not simulate message delivery between channels configured to the same Kafka topic.
ja_jp: インメモリーチャネルを使用すると、Kafka ブローカーを開始せずにメッセージ処理のアプリケーションコードをテストできました。異なるインメモリーチャネルは独立しており、チャネルコネクターをインメモリーに切り替えても、同じ Kafka トピックに設定されたチャネル間でメッセージ配信をシミュレートしないことに注意してください。

source: With injected JWT parser
ja_jp: 注入された JWT パーサーを使用

source: With just a few lines of reactive code, Polaris achieves multi-tenant request routing that would typically require significantly more boilerplate in traditional frameworks.
ja_jp: わずか数行のリアクティブコードで、Polaris は、従来のフレームワークでは通常はるかに多くの定型コードを必要とするマルチテナントリクエストルーティングを実現します。

source: With log message parameters enabled, the first log message sent to Elasticsearch will have a `MessageParam0` parameter with an `int` type; this will configure the index with a field of type `integer`. When the second message will arrive to Elasticsearch, it will have a `MessageParam0` parameter with the boolean value `true`, and this will generate an indexing error.
ja_jp: ログメッセージのパラメータを有効にすると、Elasticsearch に送信される最初のログメッセージは `int` 型の `MessageParam0` パラメータが設定され、これにより `integer` 型のフィールドでインデックスが構成されます。2 番目のメッセージが Elasticsearch に届くと、ブーリアン値 `true` を持つ `MessageParam0` パラメータが設定され、これによりインデックス作成エラーが発生します。

source: With many experimental features being added to the Qute templating engine, we aim to continue updating Qute language support to encourage current and aspiring Quarkus developers everywhere to give Qute a try!
ja_jp: Quteテンプレートエンジンに多くの実験的な機能が追加されているため、Qute言語サポートの更新を継続し、世界中のQuarkus開発者や意欲的な開発者にQuteを試してもらうことを目指しています。

source: With minimal integration, it is possible to leverage the AWS Java SDK v2, which can be used to invoke services such as SQS, SNS, S3 and DynamoDB.
ja_jp: 最小限のインテグレーションで、AWSのJava SDK v2を活用し、SQS、SNS、S3、DynamoDBなどのサービスを呼び出すことが可能です。

source: With profiles, Compose files can define a set of active profiles so that started services are adjusted for various usages and environments. You can specify the profiles to activate by setting the `quarkus.compose.devservices.profiles` property in the `application.properties` file:
ja_jp: プロファイルを使用すると、Compose ファイルはアクティブなプロファイルのセットを定義でき、それによって起動されたサービスはさまざまな用途や環境に合わせて調整されます。アクティブ化するプロファイルは、 `application.properties` ファイルで `quarkus.compose.devservices.profiles` プロパティーを設定して指定できます:

source: With single-page applications (SPA), you typically want to avoid redirects by removing default page paths, as shown in the following example:
ja_jp: シングルページアプリケーション (SPA) では、通常、次の例に示すように、デフォルトのページパスを削除してリダイレクトを回避する必要があります。

source: With static topology, the first node in the configuration is assumed to be a _master_ node, while the remaining nodes are assumed to be _replicas_. The nodes are not verified; it is a responsibility of the application developer to ensure that the static configuration is correct.
ja_jp: 静的トポロジーでは、設定内の最初のノードは _マスター_ ノードと見なされ、残りのノードは _レプリカ_ と見なされます。 ノードは検証されません。アプリケーション開発者が責任を持って、静的設定が正しいことを確認するようにしてください。

source: With such a configuration, the JSON metrics will be available from `http://0.0.0.0:9000/q/metrics/json`. The Prometheus metrics will be available from `http://0.0.0.0:9000/q/metrics/prometheus`.
ja_jp: このような設定にすると、JSON メトリクスは `http://0.0.0.0:9000/q/metrics/json` から利用可能になります。Prometheus メトリクスは `http://0.0.0.0:9000/q/metrics/prometheus` から利用可能になります。

source: With such a configuration, the json metrics will be available from `http://0.0.0.0:9000/q/metrics/json`. The prometheus metrics will be available from `http://0.0.0.0:9000/q/metrics/prometheus`.
ja_jp: このような設定にすることで、json メトリクスが `http://0.0.0.0:9000/q/metrics/json` で利用可能になります。prometheus メトリクスは、 `http://0.0.0.0:9000/q/metrics/prometheus` で利用可能になります。

source: With such a setup, you will need to take care to only ever access the _active_ persistence unit. To do so, you may define a xref:cdi.adoc#ok-you-said-that-there-are-several-kinds-of-beans[CDI bean producer] for the default `Session` redirecting to the currently active named `Session`, so that it can be injected directly, like this:
ja_jp: このようなセットアップでは、常に _アクティブ_ な永続化ユニットのみをアクセスするように注意する必要があります。 そのためには、現在アクティブな名前付き `Session` にリダイレクトするデフォルトの `Session` の xref:cdi.adoc#ok-you-said-that-there-are-several-kinds-of-beans[CDI Bean プロデューサー] を定義し、直接インジェクトできるようにすることができます。以下に例を示します。

source: With such potential in our hands, we chose the popular https://github.com/google/cel-go[Google CEL], a Go library/API adopted by several Go operators, and decided to integrate it in our application.
ja_jp: このポテンシャルを手に、我々はいくつかの Go オペレーターで採用されている人気の高い https://github.com/google/cel-go[Google CEL] (Go ライブラリー/API) を選択し、アプリケーションに統合することにしました。

source: With that in place running `jbang quarkusapp.java` will log and render as expected.
ja_jp: これにより、 `jbang quarkusapp.java` を実行すると、期待通りにロギングが行われます。

source: With that you can create your `FruitResource` skeleton and inject a `io.vertx.mutiny.pgclient.PgPool` instance:
ja_jp: これにより、 `FruitResource` スケルトンを作成し、 `io.vertx.mutiny.pgclient.PgPool` インスタンスを挿入できます。

source: With that you can create your `FruitResource` skeleton and inject a `io.vertx.mutiny.sqlclient.Pool` instance:
ja_jp: これで、 `FruitResource` スケルトンを作成し、 `io.vertx.mutiny.sqlclient.Pool` インスタンスを注入することができます：

source: With that you may create your `FruitResource` skeleton and `@Inject` a `io.vertx.mutiny.pgclient.PgPool` instance:
ja_jp: これで `FruitResource` スケルトンと `@Inject` `io.vertx.mutiny.pgclient.PgPool` インスタンスを作成することができます。

source: With the 'standalone' layout, the `namespaceId` is empty by default, so the computed runtime module artifactId is the `extensionId`
ja_jp: 'standalone' レイアウトでは、 `namespaceId` はデフォルトでは空なので、計算される実行時モジュールの artifactId は `extensionId` です。

source: With the *Kafka Dev UI*, you can directly manage your Kafka cluster and perform tasks, such as:
ja_jp: *Kafka Dev UI* を使用すると、Kafkaクラスターを直接管理し、次のようなタスクを実行することができます。

source: With the Ansible collection installed on the controller, you can already directly use a playbook provided with it to build and deploy your Quarkus application:
ja_jp: コントローラにAnsibleコレクションがインストールされていれば、Quarkusアプリケーションをビルドしてデプロイするために、Ansibleに付属のplaybookを直接使用することができます：

source: With the Artemis properties configured, you can resume the steps above from <<get-it-running>>.
ja_jp: Artemisのプロパティーを設定した状態で、 <<get-it-running>> から上記の手順を再開することができます。

source: With the Artemis properties configured, you can resume the steps above from xref:get-it-running[Get it running].
ja_jp: Artemisのプロパティが設定された状態で、 xref:get-it-running[実行] から上記の手順を再開することができます。

source: With the Hibernate ORM extension, xref:hibernate-orm.adoc#multiple-persistence-units[you can set up multiple persistence units], each with its own datasource and configuration.
ja_jp: Hibernate ORM エクステンションでは、 xref:hibernate-orm.adoc#multiple-persistence-units[複数の永続化ユニットを設定することができ]、それぞれが独自のデータソースと設定を持つことができます。

source: With the JDK Flight Recorder and the application running, we can make a request to the provided endpoint:
ja_jp: JDK Flight Recorder とアプリケーションが実行中の状態で、提供されたエンドポイントにリクエストを送信できます。

source: With the Java Flight Recorder and the application running, we can make a request to the provided endpoint:
ja_jp: Java Flight Recorder とアプリケーションが実行中の状態で、提供されたエンドポイントにリクエストを送信できます。

source: With the OpenTelemetry Collector, Jaeger system and application running, you can make a request to the provided endpoint:
ja_jp: OpenTelemetry Collector、Jaegerシステム、アプリケーションが動作している状態で、提供されているエンドポイントにリクエストを出すことができます。

source: With the OpenTelemetry Collector, the Jaeger system and the application running, you can make a request to the provided endpoint:
ja_jp: OpenTelemetry Collector、Jaegerシステム、アプリケーションが動作している状態で、提供されているエンドポイントにリクエストを出すことができます。

source: With the Quarkus OpenID Connect (OIDC) extension, you can protect application HTTP endpoints by using the OIDC Authorization Code Flow mechanism.
ja_jp: Quarkus OpenID Connect（OIDC）エクステンションを使用すると、OIDC 認可コードフローメカニズムを使用して、アプリケーションのHTTPエンドポイントを保護できます。

source: With the Quarkus tooling
ja_jp: Quarkusツーリングを使う方法

source: With the SnapStart feature, it is possible to run Quarkus in JVM mode with similar and, in some cases, faster startup times than the native image in the AWS Lambda environment. For this to work, developers need to ensure that applications can startup in a safe state, e.g., network connections, resources, etc. Luckily if you are using Quarkus a lot of this is done for you.
ja_jp: SnapStart機能を使用すると、AWS Lambda環境のネイティブイメージと同様の、場合によってはより高速な起動時間で、QuarkusをJVMモードで実行することが可能です。これを実現するためには、開発者はアプリケーションが安全な状態で起動できること、例えばネットワーク接続やリソースなどを確保する必要があります。幸いなことに、Quarkusを使用している場合、この多くは実施済です。

source: With the Vert.x based server
ja_jp: Vert.x ベースのサーバーの場合

source: With the `./conf` containing the `mosquitto.conf` file:
ja_jp: `mosquitto.conf` ファイルを含む `./conf` の場合:

source: With the `2.0.0.Final` version of the CLI, specifying `-P :quarkus-bom:` is equivalent to `-P io.quarkus:quarkus-bom:2.0.0.Final`. Specifying `-P 999-SNAPSHOT` is equivalent to `-P io.quarkus:quarkus-bom:999-SNAPSHOT`.
ja_jp: `2.0.0.Final` バージョンの CLI では、 `-P :quarkus-bom:` を指定すると、 `-P io.quarkus:quarkus-bom:2.0.0.Final` と同じになります。 `-P 999-SNAPSHOT` を指定すると、 `-P io.quarkus:quarkus-bom:999-SNAPSHOT` と同じになります。

source: With the `2.1.0.Final` version of the CLI, `io.quarkus.platform` is the default group id. Specifying `-P :quarkus-bom:` is equivalent to `-P io.quarkus.platform:quarkus-bom:2.1.0.Final`. Note that you need to specify the group id to work with a snapshot, e.g `-P io.quarkus::999-SNAPSHOT` is equivalent to `-P io.quarkus:quarkus-bom:999-SNAPSHOT`.
ja_jp: `2.1.0.Final` バージョンの CLI では、 `io.quarkus.platform` がデフォルトのグループ ID です。 `-P :quarkus-bom:` を指定すると、 `-P io.quarkus.platform:quarkus-bom:2.1.0.Final` と同じになります。スナップショットで作業するにはグループ ID を指定する必要があることに注意してください。例えば、 `-P io.quarkus::999-SNAPSHOT` は `-P io.quarkus:quarkus-bom:999-SNAPSHOT` と同じになります。

source: With the `2.1.0.Final` version of the CLI, `io.quarkus.platform` is the default group id. Specifying `-P :quarkus-bom:` is equivalent to `-P io.quarkus.platform:quarkus-bom:2.1.0.Final`. Note that you need to specify the group id to work with a snapshot, e.g. `-P io.quarkus::999-SNAPSHOT` is equivalent to `-P io.quarkus:quarkus-bom:999-SNAPSHOT`.
ja_jp: `2.1.0.Final` バージョンの CLI では、 `io.quarkus.platform` がデフォルトのグループ ID です。 `-P :quarkus-bom:` を指定すると、 `-P io.quarkus.platform:quarkus-bom:2.1.0.Final` と同じになります。スナップショットで作業するにはグループ ID を指定する必要があることに注意してください。例えば、 `-P io.quarkus::999-SNAPSHOT` は `-P io.quarkus:quarkus-bom:999-SNAPSHOT` と同じになります。

source: With the `@Blocking` annotation, the MyResponseExceptionMapper exception mapper will be executed in the worker thread pool.
ja_jp: `@Blocking` アノテーションにより、MyResponseExceptionMapper例外マッパーはワーカースレッドプールで実行されることになります。

source: With the `Emitter` API, you can also encapsulate the outgoing payload inside `Message<T>`. As with the previous examples, `Message` lets you handle the ack/nack cases differently.
ja_jp: `Emitter` API を使用すると、 `Message<T>` 内に送信ペイロードをカプセル化することもできます。前出の例のように、 `Message` では、ack/nack のケースを異なる方法で処理できます。

source: With the `callback` mode, expect getting a `jakarta.validation.ConstraintViolationException` thrown:
ja_jp: `callback` モードでは、 `jakarta.validation.ConstraintViolationException` がスローされることを期待してください。

source: With the `ddl` mode enabled, the resulting schema would be expected to have the following constraints:
ja_jp: `ddl` モードを有効にした場合、生成されるスキーマには以下の制約が含まれることが期待されます。
